app/controllers/inventory_management_controller.rb

  def ingredients
    @ingredients = Ingredient.search(params[:search]).page(params[:page]).per(20)
---
SELECT "ingredients".* FROM "ingredients" WHERE (name LIKE '%%')  ORDER BY code asc
SELECT COUNT(*) FROM "ingredients" WHERE (name LIKE '%red%')

  def create_ingredients

  	# create a new ingredient record for each field in the submitted form
  	params[:fields].each do |i, values|

  	  # screen the values (compulsory for Rails 4)
  	  permitted_values = values.permit(:name, :price, :unit, :interval)

  	  # create new ingredient record
      ingredient = Ingredient.new(permitted_values)
      ingredient.save
---
INSERT INTO "ingredients" ("name", "price", "unit", "interval", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Hello from the adslfkj"], ["price", 343.0], ["unit", "sldkfjl"], ["interval", 23.0], ["created_at", "2016-02-25 07:43:06.122791"], ["updated_at", "2016-02-25 07:43:06.122791"]]